### 국K-MOOC  데이터베이스 보안 강의 청강

<br>

#### 강의요강 중 집중해서 들을 부분
* 5주차. 데이터베이스 보안 개요
* 6주차. 데이터베이스 관리 시스템 (DBMS) 보안
* 7주차. 데이터베이스 시스템 보안
* 9주차. 접근제어(1)
* 10주차. 접근제어(2)
* 11주차. 데이터베이스 암호화 개요
* 12주차. 데이터베이스 암호화 설계 및 구축


<br>



### 강의 요강
* 1주차. 데이터베이스 개요
  * 데이터 베이스 개념/시스템/추상화레벨/모델/설계
* 2주차. 데이터베이스 관리 시스템 (DBMS)
  * 데이터베이스 시스템 환경
  * DBMS 개요/ 사용자 및 기능 / DBMS 언어/ 종류 및 특징
* 3주차. 관계형 데이터베이스 (RDB)
  * 개요/ Key종류/ 무결성 제약 조건/ 관계대수
* 4주차. 구조화 질의어 (SQL)
  * 구조화 질의어 개념/ DDL/ DML/ DCL
* 5주차. 데이터베이스 보안 개요
  * 정보보호 개념
  * 데이터베이스 보안 개요/공격사례 /보안 요구사항/ 보안 기술
* 6주차. 데이터베이스 관리 시스템 (DBMS) 보안
  * 데이터베이스 관리자
  * 사용자 생성 및 권한부여
  * 역할/ 뷰/ 데이터베이스 감사
* 7주차. 데이터베이스 시스템 보안
  * 사용자 인증 및 권한부여
  * 데이터베이스 접근제어 관리/ 취약점 분석/ 취약점 점검/ 베이터베이스 보안 개발
* 8주차. 중간고사
* 9주차. 접근제어(1)
  * 접근제어 개요/ 설계/ 구축
  * 임의적 접근제어(DAC) 개요/ 모델
* 10주차. 접근제어(2)
  * 강제적 접근제어(MAC) 개요/ 모델
  * 역할기반 접근제어(RABC) 개요/ 모델
  * 속성기반 접근제어(ABAC) 모델
* 11주차. 데이터베이스 암호화 개요
  * 데이터베이스 암호화 개념
  * 암호화 방식 및 알고리즘
  * 데이터베이스 암호화 방식 DB서버내부/DB서버외부
  * DB암호화 제품의 보안 요구사항
* 12주차. 데이터베이스 암호화 설계 및 구축
  * 데이터베이스 암호화 설계/ 구축/ 운영
  * 오라클 DBMS 암호화
  * MySQL DBMS 암호화
* 13주차. 빅데이터 보안 개요
  * 데이터 개요
  * 빅데이터 속성/ 생명주기/ 요소 기술/ 보안 개념
* 14주차. 빅데이터 보안 기술
  * 데이터 수집단계/ 저장단계/ 처리단계/ 활용단계/ 폐기단계
* 15주차. 기말고사



